Vulnerability Test Results/artillery-load-test.yml
config:
  target: 'http://localhost:5000'
  phases:
    - duration: 60
      arrivalRate: 5
      rampTo: 50
      name: Warm up phase
    - duration: 120
      arrivalRate: 50
      name: Sustained load phase
scenarios:
  - name: "Fetch overview and search info"
    flow:
      - get:
          url: "/api/overview"
      - get:
          url: "/api/after10th/categories"
